RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_dma.c
/**
 *******************************************************************************
 * @file  hc32_ll_dma.c
 * @brief This file provides firmware functions to manage the Direct Memory
 *        Access (DMA).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_dma.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_DMA DMA
 * @brief Direct Memory Access Driver Library
 * @{
 */

#if (LL_DMA_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup DMA_Local_Macros DMA Local Macros
 * @{
 */
#define DMA_CH_REG(reg_base, ch)    (*(__IO uint32_t *)((uint32_t)(&(reg_base)) + ((ch) * 0x40UL)))

#define DMA_CNT                     (10U)
#define DMA_IDLE                    (0U)
#define DMA_BUSY                    (1U)
#define DMATIMEOUT1                 (0x5000U)
#define DMATIMEOUT2                 (0x1000u)

/**
 * @defgroup DMA_Check_Parameters_Validity DMA Check Parameters Validity
 * @{
 */
/* Parameter valid check for DMA unit. */
#define IS_DMA_UNIT(x)                                                          \
(   ((x) == CM_DMA1)                        ||                                  \
    ((x) == CM_DMA2))

/* Parameter valid check for DMA channel. */
#define IS_DMA_CH(x)                ((x) <= DMA_CH3)

/* Parameter valid check for DMA multiplex channel. */
#define IS_DMA_MX_CH(x)                                                         \
(   ((x) != 0x00UL)                        &&                                   \
    (((x) | DMA_MX_CH_ALL) == DMA_MX_CH_ALL))

/* Parameter valid check for DMA block size. */
#define IS_DMA_BLOCK_SIZE(x)        ((x) < 1024U)

/* Parameter valid check for DMA non-sequence transfer count. */
#define IS_DMA_NON_SEQ_TRANS_CNT(x) ((x) < 4096U)

/* Parameter valid check for DMA non-sequence offset. */
#define IS_DMA_NON_SEQ_OFFSET(x)    ((x) <= ((1UL << 20U) - 1UL))

/* Parameter valid check for DMA LLP function. */
#define IS_DMA_LLP_EN(x)                                                        \
(   ((x) == DMA_LLP_ENABLE)                 ||                                  \
    ((x) == DMA_LLP_DISABLE))

/* Parameter valid check for DMA linked-list-pointer mode. */
#define IS_DMA_LLP_MD(x)                                                        \
(   ((x) == DMA_LLP_RUN)                    ||                                  \
    ((x) == DMA_LLP_WAIT))

/* Parameter valid check for DMA error flag. */
#define IS_DMA_ERR_FLAG(x)                                                      \
(   ((x)!= 0x00000000UL)                    &&                                  \
    (((x)| DMA_FLAG_ERR_MASK) == DMA_FLAG_ERR_MASK))

/* Parameter valid check for DMA transfer flag. */
#define IS_DMA_TRANS_FLAG(x)                                                    \
(   ((x)!= 0x00000000UL)                    &&                                  \
    (((x)| DMA_FLAG_TRANS_MASK) == DMA_FLAG_TRANS_MASK))

/* Parameter valid check for DMA error interrupt. */
#define IS_DMA_ERR_INT(x)                                                       \
(   ((x)!= 0x00000000UL)                    &&                                  \
    (((x)| DMA_INT_ERR_MASK) == DMA_INT_ERR_MASK))

/* Parameter valid check for DMA transfer interrupt. */
#define IS_DMA_TRANS_INT(x)                                                     \
(   ((x)!= 0x00000000UL)                    &&                                  \
    (((x)| DMA_INT_TRANS_MASK) == DMA_INT_TRANS_MASK))

/* Parameter valid check for DMA request status. */
#define IS_DMA_REQ_STAT(x)                                                      \
(   ((x) != 0x00000000UL)                   &&                                  \
    (((x) | DMA_STAT_REQ_MASK) == DMA_STAT_REQ_MASK))

/* Parameter valid check for DMA channel status. */
#define IS_DMA_TRANS_STAT(x)                                                    \
(   ((x) != 0x00000000UL)                   &&                                  \
    (((x) | DMA_STAT_TRANS_MASK) == DMA_STAT_TRANS_MASK))

/* Parameter valid check for DMA transfer data width. */
#define IS_DMA_DATA_WIDTH(x)                                                    \
(   ((x) == DMA_DATAWIDTH_8BIT)             ||                                  \
    ((x) == DMA_DATAWIDTH_16BIT)            ||                                  \
    ((x) == DMA_DATAWIDTH_32BIT))

/* Parameter valid check for DMA source address mode. */
#define IS_DMA_SADDR_MD(x)                                                      \
(   ((x) == DMA_SRC_ADDR_FIX)               ||                                  \
    ((x) == DMA_SRC_ADDR_INC)               ||                                  \
    ((x) == DMA_SRC_ADDR_DEC))

/* Parameter valid check for DMA destination address mode. */
#define IS_DMA_DADDR_MD(x)                                                      \
(   ((x) == DMA_DEST_ADDR_FIX)              ||                                  \
    ((x) == DMA_DEST_ADDR_INC)              ||                                  \
    ((x) == DMA_DEST_ADDR_DEC))

