RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_dma.c
/* Parameter valid check for DMA repeat mode. */
#define IS_DMA_RPT_MD(x)                                                        \
(   ((x) == DMA_RPT_NONE)                   ||                                  \
    ((x) == DMA_RPT_SRC)                    ||                                  \
    ((x) == DMA_RPT_DEST)                   ||                                  \
    ((x) == DMA_RPT_BOTH))

/* Parameter valid check for DMA non_sequence mode. */
#define IS_DMA_NON_SEQ_MD(x)                                                    \
(   ((x) == DMA_NON_SEQ_NONE)               ||                                  \
    ((x) == DMA_NON_SEQ_SRC)                ||                                  \
    ((x) == DMA_NON_SEQ_DEST)               ||                                  \
    ((x) == DMA_NON_SEQ_BOTH))

/* Parameter valid check for DMA global interrupt function. */
#define IS_DMA_INT_FUNC(x)                                                      \
(   ((x) == DMA_INT_ENABLE)                 ||                                  \
    ((x) == DMA_INT_DISABLE))

/* Parameter valid check for DMA reconfig count mode. */
#define IS_DMA_RC_CNT_MD(x)                                                     \
(   ((x) == DMA_RC_CNT_KEEP)                ||                                  \
    ((x) == DMA_RC_CNT_SRC)                 ||                                  \
    ((x) == DMA_RC_CNT_DEST))

/* Parameter valid check for DMA reconfig destination address mode. */
#define IS_DMA_RC_DA_MD(x)                                                      \
(   ((x) == DMA_RC_DEST_ADDR_KEEP)          ||                                  \
    ((x) == DMA_RC_DEST_ADDR_NS)            ||                                  \
    ((x) == DMA_RC_DEST_ADDR_RPT))

/* Parameter valid check for DMA reconfig source address mode. */
#define IS_DMA_RC_SA_MD(x)                                                      \
(   ((x) == DMA_RC_SRC_ADDR_KEEP)           ||                                  \
    ((x) == DMA_RC_SRC_ADDR_NS)             ||                                  \
    ((x) == DMA_RC_SRC_ADDR_RPT))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup DMA_Global_Functions DMA Global Functions
 * @{
 */

/**
 * @brief  DMA global function config.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] enNewState An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void DMA_Cmd(CM_DMA_TypeDef *DMAx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* Global setting, ENABLE or DISABLE DMA */
    WRITE_REG32(DMAx->EN, enNewState);
}

/**
 * @brief  DMA error IRQ function config.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u32ErrInt DMA error IRQ flag.  @ref DMA_Int_Request_Err_Sel, @ref DMA_Int_Trans_Err_Sel
 * @param  [in] enNewState An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void DMA_ErrIntCmd(CM_DMA_TypeDef *DMAx, uint32_t u32ErrInt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_ERR_INT(u32ErrInt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE == enNewState) {
        SET_REG32_BIT(DMAx->INTMASK0, u32ErrInt);
    } else {
        CLR_REG32_BIT(DMAx->INTMASK0, u32ErrInt);
    }
}

/**
 * @brief  Get DMA error flag.
 * @param  [in] DMAx        DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u32Flag     DMA error IRQ flag.  @ref DMA_Flag_Trans_Err_Sel, @ref DMA_Flag_Request_Err_Sel
 * @retval An @ref en_flag_status_t enumeration type value.
 * @note   Include transfer error flag & request error flag
 */
en_flag_status_t DMA_GetErrStatus(const CM_DMA_TypeDef *DMAx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_ERR_FLAG(u32Flag));

    return (0U != READ_REG32_BIT(DMAx->INTSTAT0, u32Flag) ? SET : RESET);
}

/**
 * @brief  Clear DMA error flag.
 * @param  [in] DMAx        DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u32Flag     DMA error IRQ flag. @ref DMA_Flag_Trans_Err_Sel, @ref DMA_Flag_Request_Err_Sel
 * @retval None
 * @note   Include transfer error flag & request error flag
 */
void DMA_ClearErrStatus(CM_DMA_TypeDef *DMAx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_ERR_FLAG(u32Flag));

    SET_REG32_BIT(DMAx->INTCLR0, u32Flag);
}

/**
 * @brief  DMA transfer IRQ function config.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u32TransCompleteInt DMA transfer complete IRQ flag. @ref DMA_Int_Btc_Sel, @ref DMA_Int_Tc_Sel
 * @param  [in] enNewState An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void DMA_TransCompleteIntCmd(CM_DMA_TypeDef *DMAx, uint32_t u32TransCompleteInt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_TRANS_INT(u32TransCompleteInt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE == enNewState) {
        SET_REG32_BIT(DMAx->INTMASK1, u32TransCompleteInt);
    } else {
        CLR_REG32_BIT(DMAx->INTMASK1, u32TransCompleteInt);
    }
}

/**
 * @brief  Get DMA transfer flag.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u32Flag DMA transfer IRQ flag. @ref DMA_Flag_Btc_Sel, @ref DMA_Flag_Tc_Sel
 * @retval An @ref en_flag_status_t enumeration type value.
 * @note   Include transfer complete flag & block transfer complete flag
 */
en_flag_status_t DMA_GetTransCompleteStatus(const CM_DMA_TypeDef *DMAx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_DMA_TRANS_FLAG(u32Flag));
    return ((0U != READ_REG32_BIT(DMAx->INTSTAT1, u32Flag)) ? SET : RESET);
}

/**
 * @brief  Clear DMA transfer flag.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u32Flag DMA transfer complete flag.  @ref DMA_Flag_Btc_Sel, @ref DMA_Flag_Tc_Sel
 * @retval None
 * @note   Include transfer complete flag & block transfer complete flag
 */
void DMA_ClearTransCompleteStatus(CM_DMA_TypeDef *DMAx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_TRANS_FLAG(u32Flag));

