RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_dma.c
    SET_REG32_BIT(DMAx->INTCLR1, u32Flag);
}

/**
 * @brief  DMA channel function config.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] enNewState An @ref en_functional_state_t enumeration value.
 * @retval int32_t
 */
int32_t DMA_ChCmd(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, en_functional_state_t enNewState)
{
    static __IO uint8_t u8DmaChEnState = DMA_IDLE;

    uint16_t u16Timeout = 0U;
    uint32_t u32Temp;
    uint32_t u32Count;
    uint32_t u32MonCount;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DMA_IDLE == u8DmaChEnState) {
        u8DmaChEnState = DMA_BUSY;

        /* Read back channel enable register except current channel */
        u32Temp = (DMAx->CHEN & (~(1UL << u8Ch)));
        if (0UL != u32Temp) {
            if (((DMAx->CHEN & DMA_CHEN_CHEN_0) == DMA_CHEN_CHEN_0) && (u8Ch != DMA_CH0)) {
                u32Count = (DMAx->DTCTL0 & DMA_DTCTL_CNT) >> DMA_DTCTL_CNT_POS;
                u32MonCount = (DMAx->MONDTCTL0 & DMA_MONDTCTL_CNT) >> DMA_MONDTCTL_CNT_POS;
                if (u32MonCount > DMA_CNT) {
                    /* not wait. */
                } else if (u32MonCount < u32Count) {
                    while (0UL != (DMAx->CHEN & DMA_CHEN_CHEN_0)) {
                        u16Timeout++;
                        if (u16Timeout > DMATIMEOUT1) {
                            u8DmaChEnState =  DMA_IDLE;
                            return LL_ERR_TIMEOUT;
                        }
                    }
                } else {
                    /* else */
                }
            }
            if (((DMAx->CHEN & DMA_CHEN_CHEN_1) == DMA_CHEN_CHEN_1) && (u8Ch != DMA_CH1)) {
                u32Count = (DMAx->DTCTL1 & DMA_DTCTL_CNT) >> DMA_DTCTL_CNT_POS;
                u32MonCount = (DMAx->MONDTCTL1 & DMA_MONDTCTL_CNT) >> DMA_MONDTCTL_CNT_POS;
                if (u32MonCount > DMA_CNT) {
                    /* not wait. */
                } else if (u32MonCount < u32Count) {
                    u16Timeout = 0U;
                    while (0UL != (DMAx->CHEN & DMA_CHEN_CHEN_1)) {
                        u16Timeout++;
                        if (u16Timeout > DMATIMEOUT1) {
                            u8DmaChEnState =  DMA_IDLE;
                            return LL_ERR_TIMEOUT;
                        }
                    }
                } else {
                    /* else */
                }
            }
            if (((DMAx->CHEN & DMA_CHEN_CHEN_2) == DMA_CHEN_CHEN_2) && (u8Ch != DMA_CH2)) {
                u16Timeout = 0U;
                u32Count = (DMAx->DTCTL2 & DMA_DTCTL_CNT) >> DMA_DTCTL_CNT_POS;
                u32MonCount = (DMAx->MONDTCTL2 & DMA_MONDTCTL_CNT) >> DMA_MONDTCTL_CNT_POS;
                if (u32MonCount > DMA_CNT) {
                    /* not wait. */
                } else if (u32MonCount < u32Count) {
                    while (0UL != (DMAx->CHEN & DMA_CHEN_CHEN_2)) {
                        u16Timeout++;
                        if (u16Timeout > DMATIMEOUT1) {
                            u8DmaChEnState =  DMA_IDLE;
                            return LL_ERR_TIMEOUT;
                        }
                    }
                } else {
                    /* else */
                }
            }
            if (((DMAx->CHEN & DMA_CHEN_CHEN_3) == DMA_CHEN_CHEN_3) && (u8Ch != DMA_CH3)) {
                u16Timeout = 0U;
                u32Count = (DMAx->DTCTL3 & DMA_DTCTL_CNT) >> DMA_DTCTL_CNT_POS;
                u32MonCount = (DMAx->MONDTCTL3 & DMA_MONDTCTL_CNT) >> DMA_MONDTCTL_CNT_POS;
                if (u32MonCount > DMA_CNT) {
                    /* not wait. */
                } else if (u32MonCount < u32Count) {
                    while (0UL != (DMAx->CHEN & DMA_CHEN_CHEN_3)) {
                        u16Timeout++;
                        if (u16Timeout > DMATIMEOUT1) {
                            u8DmaChEnState =  DMA_IDLE;
                            return LL_ERR_TIMEOUT;
                        }
                    }
                } else {
                    /* else */
                }
            }
        }

        if (ENABLE == enNewState) {
            DMAx->CHEN |= (1UL << u8Ch) & DMA_CHEN_CHEN;
        } else {
            DMAx->CHEN &= (~(1UL << u8Ch)) & DMA_CHEN_CHEN;
        }

        u8DmaChEnState =  DMA_IDLE;
        return LL_OK;
    }

    return LL_ERR;
}

/**
 * @brief  Get DMA transfer status.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u32Status DMA transfer status. @ref DMA_Trans_Status_Sel
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t DMA_GetTransStatus(const CM_DMA_TypeDef *DMAx, uint32_t u32Status)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_TRANS_STAT(u32Status));

    return ((0U != READ_REG32_BIT(DMAx->CHSTAT, u32Status)) ? SET : RESET);
}

/**
 * @brief  Get DMA request status.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u32Status DMA request status. @ref DMA_Req_Status_Sel
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t DMA_GetRequestStatus(const CM_DMA_TypeDef *DMAx, uint32_t u32Status)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_REQ_STAT(u32Status));

    return ((0U != READ_REG32_BIT(DMAx->REQSTAT, u32Status)) ? SET : RESET);
}

/**
 * @brief  Config DMA source address.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u32Addr DMA source address.
 * @retval int32_t
 */
int32_t DMA_SetSrcAddr(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Addr)
{
    uint16_t u16Timeout = 0U;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    WRITE_REG32(DMA_CH_REG(DMAx->SAR0, u8Ch), u32Addr);

    /* Ensure the address has been written */
    while (u32Addr != READ_REG32(DMA_CH_REG(DMAx->SAR0, u8Ch))) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            WRITE_REG32(DMA_CH_REG(DMAx->SAR0, u8Ch), u32Addr);
        }
    }
    return LL_OK;
}

/**
 * @brief  Config DMA destination address.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u32Addr DMA destination address.
 * @retval int32_t
 */
int32_t DMA_SetDestAddr(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Addr)
{
    uint16_t u16Timeout = 0U;

