RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_dma.c
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    WRITE_REG32(DMA_CH_REG(DMAx->DAR0, u8Ch), u32Addr);

    /* Ensure the address has been written */
    while (u32Addr != READ_REG32(DMA_CH_REG(DMAx->DAR0, u8Ch))) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            WRITE_REG32(DMA_CH_REG(DMAx->DAR0, u8Ch), u32Addr);
        }
    }
    return LL_OK;
}

/**
 * @brief  Config DMA transfer count.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u16Count DMA transfer count (0: infinite, 1 ~ 65535).
 * @retval int32_t
 */
int32_t DMA_SetTransCount(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint16_t u16Count)
{
    uint16_t u16Timeout = 0U;
    __IO uint32_t *DTCTLx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    DTCTLx = &DMA_CH_REG(DMAx->DTCTL0, u8Ch);
    MODIFY_REG32(*DTCTLx, DMA_DTCTL_CNT, ((uint32_t)(u16Count) << DMA_DTCTL_CNT_POS));
    /* Ensure the transfer count has been written */
    while (u16Count != (READ_REG32_BIT(*DTCTLx, DMA_DTCTL_CNT) >> DMA_DTCTL_CNT_POS)) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            MODIFY_REG32(*DTCTLx, DMA_DTCTL_CNT, ((uint32_t)(u16Count) << DMA_DTCTL_CNT_POS));
        }
    }
    return LL_OK;
}

/**
 * @brief  Config DMA block size per transfer.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u16Size DMA block size (range: 1~1024, 0 is for 1024).
 * @retval int32_t
 */
int32_t DMA_SetBlockSize(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint16_t u16Size)
{
    uint16_t u16Timeout = 0U;
    __IO uint32_t *DTCTLx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_BLOCK_SIZE(u16Size));

    DTCTLx = &DMA_CH_REG(DMAx->DTCTL0, u8Ch);
    MODIFY_REG32(*DTCTLx, DMA_DTCTL_BLKSIZE, u16Size);

    /* Ensure the block size has been written */
    while (u16Size != READ_REG32_BIT(*DTCTLx, DMA_DTCTL_BLKSIZE)) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            MODIFY_REG32(*DTCTLx, DMA_DTCTL_BLKSIZE, u16Size);
        }
    }

    return LL_OK;
}

/**
 * @brief  Config DMA source repeat size.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u16Size DMA source repeat size (0, 1024: 1024, 1 ~ 1023).
 * @retval int32_t
 */
int32_t DMA_SetSrcRepeatSize(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint16_t u16Size)
{
    uint16_t u16Timeout = 0U;
    __IO uint32_t *RPTx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_BLOCK_SIZE(u16Size));

    RPTx = &DMA_CH_REG(DMAx->RPT0, u8Ch);
    MODIFY_REG32(*RPTx, DMA_RPT_SRPT, ((uint32_t)(u16Size) << DMA_RPT_SRPT_POS));

    /* Ensure the repeat size has been written */
    while (u16Size != (READ_REG32_BIT(*RPTx, DMA_RPT_SRPT) >> DMA_RPT_SRPT_POS)) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            MODIFY_REG32(*RPTx, DMA_RPT_SRPT, ((uint32_t)(u16Size) << DMA_RPT_SRPT_POS));
        }
    }

    return LL_OK;
}

/**
 * @brief  Config DMA destination repeat size.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u16Size DMA destination repeat size (0, 1024: 1024, 1 ~ 1023).
 * @retval int32_t
 */
int32_t DMA_SetDestRepeatSize(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint16_t u16Size)
{
    uint16_t u16Timeout = 0U;
    __IO uint32_t *RPTx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_BLOCK_SIZE(u16Size));

    RPTx = &DMA_CH_REG(DMAx->RPT0, u8Ch);
    MODIFY_REG32(*RPTx, DMA_RPT_DRPT, ((uint32_t)(u16Size) << DMA_RPT_DRPT_POS));

    /* Ensure the repeat size has been written */
    while (u16Size != (READ_REG32_BIT(*RPTx, DMA_RPT_DRPT) >> DMA_RPT_DRPT_POS)) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            MODIFY_REG32(*RPTx, DMA_RPT_DRPT, ((uint32_t)(u16Size) << DMA_RPT_DRPT_POS));
        }
    }

    return LL_OK;
}

/**
 * @brief  Config DMA source transfter count under non-sequence mode.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u32Count DMA source transfer count (0, 4096: 4096, 1 ~ 4095).
 * @retval int32_t
 */
int32_t DMA_SetNonSeqSrcCount(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Count)
{
    uint16_t u16Timeout = 0U;
    __IO uint32_t *SNSEQCTLx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_NON_SEQ_TRANS_CNT(u32Count));

    SNSEQCTLx = &DMA_CH_REG(DMAx->SNSEQCTL0, u8Ch);
    MODIFY_REG32(*SNSEQCTLx, DMA_SNSEQCTL_SNSCNT, (u32Count << DMA_SNSEQCTL_SNSCNT_POS));

    /* Ensure the count has been written */
    while (u32Count != (READ_REG32_BIT(*SNSEQCTLx, DMA_SNSEQCTL_SNSCNT) >> DMA_SNSEQCTL_SNSCNT_POS)) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            MODIFY_REG32(*SNSEQCTLx, DMA_SNSEQCTL_SNSCNT, (u32Count << DMA_SNSEQCTL_SNSCNT_POS));
        }
    }

    return LL_OK;
}

/**
 * @brief  Config DMA destination transfter count under non-sequence mode.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u32Count DMA destination transfer count (0, 4096: 4096, 1 ~ 4095).
 * @retval int32_t
 */
int32_t DMA_SetNonSeqDestCount(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Count)
{
    uint16_t u16Timeout = 0U;
    __IO uint32_t *DNSEQCTLx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_NON_SEQ_TRANS_CNT(u32Count));

    DNSEQCTLx = &DMA_CH_REG(DMAx->DNSEQCTL0, u8Ch);
    MODIFY_REG32(*DNSEQCTLx, DMA_DNSEQCTL_DNSCNT, (u32Count << DMA_DNSEQCTL_DNSCNT_POS));

    /* Ensure the count has been written */
    while (u32Count != (READ_REG32_BIT(*DNSEQCTLx, DMA_DNSEQCTL_DNSCNT) >> DMA_DNSEQCTL_DNSCNT_POS)) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            MODIFY_REG32(*DNSEQCTLx, DMA_DNSEQCTL_DNSCNT, (u32Count << DMA_DNSEQCTL_DNSCNT_POS));
        }
    }

    return LL_OK;
}

/**
 * @brief  Config DMA source offset number under non-sequence mode.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u32Offset DMA source offset (0 ~ 2^20 - 1).
 * @retval int32_t
 */
int32_t DMA_SetNonSeqSrcOffset(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Offset)
{
    uint16_t u16Timeout = 0U;
    __IO uint32_t *SNSEQCTLx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_NON_SEQ_OFFSET(u32Offset));

    SNSEQCTLx = &DMA_CH_REG(DMAx->SNSEQCTL0, u8Ch);
    MODIFY_REG32(*SNSEQCTLx, DMA_SNSEQCTL_SOFFSET, u32Offset);

    /* Ensure the offset has been written */
    while (u32Offset != READ_REG32_BIT(*SNSEQCTLx, DMA_SNSEQCTL_SOFFSET)) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            MODIFY_REG32(*SNSEQCTLx, DMA_SNSEQCTL_SOFFSET, u32Offset);
        }
    }

    return LL_OK;
}

/**
 * @brief  Config DMA destination offset number under non-sequence mode.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] u32Offset DMA destination offset (0 ~ 2^20 - 1).
 * @retval int32_t
 */
int32_t DMA_SetNonSeqDestOffset(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Offset)
{
    uint16_t u16Timeout = 0U;
    __IO uint32_t *DNSEQCTLx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_NON_SEQ_OFFSET(u32Offset));

    DNSEQCTLx = &DMA_CH_REG(DMAx->DNSEQCTL0, u8Ch);
    MODIFY_REG32(*DNSEQCTLx, DMA_DNSEQCTL_DOFFSET, u32Offset);

    /* Ensure the offset has been written */
    while (u32Offset != READ_REG32_BIT(*DNSEQCTLx, DMA_DNSEQCTL_DOFFSET)) {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2) {
            return LL_ERR_TIMEOUT;
        } else {
            MODIFY_REG32(*DNSEQCTLx, DMA_DNSEQCTL_DOFFSET, u32Offset);
        }
    }

    return LL_OK;
}

/**
 * @brief  De-Initialize DMA function.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
  * @retval None
 */
void DMA_DeInit(CM_DMA_TypeDef *DMAx, uint8_t u8Ch)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    /* Disable */
    CLR_REG32_BIT(DMAx->CHEN, DMA_CHEN_CHEN << u8Ch);

    /* Set default value. */
    WRITE_REG32(DMA_CH_REG(DMAx->SAR0, u8Ch), 0UL);
    WRITE_REG32(DMA_CH_REG(DMAx->DAR0, u8Ch), 0UL);
    WRITE_REG32(DMAx->INTMASK0, 0UL);
    WRITE_REG32(DMAx->INTMASK1, 0UL);
    WRITE_REG32(DMAx->INTCLR0, DMA_INTCLR0_CLRTRNERR | DMA_INTCLR0_CLRREQERR);
    WRITE_REG32(DMAx->INTCLR1, DMA_INTCLR1_CLRTC | DMA_INTCLR1_CLRBTC);

    WRITE_REG32(DMA_CH_REG(DMAx->DTCTL0, u8Ch), 1UL);
    WRITE_REG32(DMA_CH_REG(DMAx->CHCTL0, u8Ch), 0x00001000UL);
    WRITE_REG32(DMA_CH_REG(DMAx->RPT0, u8Ch), 0UL);
    WRITE_REG32(DMA_CH_REG(DMAx->SNSEQCTL0, u8Ch), 0UL);
    WRITE_REG32(DMA_CH_REG(DMAx->DNSEQCTL0, u8Ch), 0UL);
    WRITE_REG32(DMA_CH_REG(DMAx->LLP0, u8Ch), 0UL);

