RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_dma.c
}

/**
 * @brief  Initialize DMA config structure. Fill each pstcDmaInit with default value
 * @param  [in] pstcDmaInit Pointer to a stc_dma_init_t structure that
 *                            contains configuration information.
 * @retval int32_t:
 *         - LL_OK: DMA structure initialize successful
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t DMA_StructInit(stc_dma_init_t *pstcDmaInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcDmaInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcDmaInit->u32IntEn       = DMA_INT_DISABLE;
        pstcDmaInit->u32SrcAddr     = 0x00UL;
        pstcDmaInit->u32DestAddr    = 0x00UL;
        pstcDmaInit->u32DataWidth   = DMA_DATAWIDTH_8BIT;
        pstcDmaInit->u32BlockSize   = 0x00UL;
        pstcDmaInit->u32TransCount  = 0x01UL;
        pstcDmaInit->u32SrcAddrInc  = DMA_SRC_ADDR_FIX;
        pstcDmaInit->u32DestAddrInc = DMA_DEST_ADDR_FIX;
    }
    return i32Ret;
}

/**
 * @brief  DMA basic function initialize.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] pstcDmaInit DMA config structure.
 *   @arg  u32IntEn         DMA interrupt ENABLE or DISABLE.
 *   @arg  u32SrcAddr       DMA source address.
 *   @arg  u32DestAddr      DMA destination address.
 *   @arg  u32DataWidth     DMA data width.
 *   @arg  u32BlockSize     DMA block size.
 *   @arg  u32TransCount    DMA transfer count.
 *   @arg  u32SrcAddrInc        DMA source address direction.
 *   @arg  u32DestAddrInc       DMA destination address direction.
  * @retval int32_t:
 *          - LL_OK: DMA basic function initialize successful
 *          - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t DMA_Init(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, const stc_dma_init_t *pstcDmaInit)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t *CHCTLx;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    if (NULL == pstcDmaInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        DDL_ASSERT(IS_DMA_DATA_WIDTH(pstcDmaInit->u32DataWidth));
        DDL_ASSERT(IS_DMA_SADDR_MD(pstcDmaInit->u32SrcAddrInc));
        DDL_ASSERT(IS_DMA_DADDR_MD(pstcDmaInit->u32DestAddrInc));
        DDL_ASSERT(IS_DMA_BLOCK_SIZE(pstcDmaInit->u32BlockSize));
        DDL_ASSERT(IS_DMA_INT_FUNC(pstcDmaInit->u32IntEn));

        WRITE_REG32(DMA_CH_REG(DMAx->SAR0, u8Ch), pstcDmaInit->u32SrcAddr);
        WRITE_REG32(DMA_CH_REG(DMAx->DAR0, u8Ch), pstcDmaInit->u32DestAddr);

        WRITE_REG32(DMA_CH_REG(DMAx->DTCTL0, u8Ch), \
                    (pstcDmaInit->u32BlockSize | (pstcDmaInit->u32TransCount << DMA_DTCTL_CNT_POS)));

        CHCTLx = &DMA_CH_REG(DMAx->CHCTL0, u8Ch);
        MODIFY_REG32(*CHCTLx, (DMA_CHCTL_SINC | DMA_CHCTL_DINC | DMA_CHCTL_HSIZE | DMA_CHCTL_IE),       \
                     (pstcDmaInit->u32IntEn | pstcDmaInit->u32DataWidth | pstcDmaInit->u32SrcAddrInc | \
                      pstcDmaInit->u32DestAddrInc));

    }
    return i32Ret;
}

/**
 * @brief  Initialize DMA repeat mode config structure.
 *          Fill each pstcDmaInit with default value
 * @param  [in] pstcDmaRepeatInit Pointer to a stc_dma_repeat_init_t structure that
 *                            contains configuration information.
  * @retval int32_t:
 *          - LL_OK: DMA repeat mode config structure initialize successful
 *          - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t DMA_RepeatStructInit(stc_dma_repeat_init_t *pstcDmaRepeatInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcDmaRepeatInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcDmaRepeatInit->u32Mode       = DMA_RPT_NONE;
        pstcDmaRepeatInit->u32SrcCount  = 0x00UL;
        pstcDmaRepeatInit->u32DestCount = 0x00UL;
    }
    return i32Ret;
}

/**
 * @brief  DMA repeat mode initialize.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] pstcDmaRepeatInit DMA repeat mode config structure.
 * @note Call this function after DMA_Init();
 */
int32_t DMA_RepeatInit(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, const stc_dma_repeat_init_t *pstcDmaRepeatInit)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t *CHCTLx;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    if (NULL == pstcDmaRepeatInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        DDL_ASSERT(IS_DMA_RPT_MD(pstcDmaRepeatInit->u32Mode));
        DDL_ASSERT(IS_DMA_BLOCK_SIZE(pstcDmaRepeatInit->u32DestCount));
        DDL_ASSERT(IS_DMA_BLOCK_SIZE(pstcDmaRepeatInit->u32SrcCount));

        CHCTLx = &DMA_CH_REG(DMAx->CHCTL0, u8Ch);
        MODIFY_REG32(*CHCTLx, (DMA_CHCTL_SRPTEN | DMA_CHCTL_DRPTEN), pstcDmaRepeatInit->u32Mode);

        WRITE_REG32(DMA_CH_REG(DMAx->RPT0, u8Ch), \
                    ((pstcDmaRepeatInit->u32DestCount << DMA_RPT_DRPT_POS) | pstcDmaRepeatInit->u32SrcCount));

    }
    return i32Ret;
}

/**
 * @brief  Initialize DMA non-sequence mode config structure.
 *          Fill each pstcDmaInit with default value
 * @param  [in] pstcDmaNonSeqInit Pointer to a stc_dma_nonseq_init_t structure that
 *                            contains configuration information.
  * @retval int32_t:
 *          - LL_OK: DMA non-sequence mode structure initialize successful
 *          - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t DMA_NonSeqStructInit(stc_dma_nonseq_init_t *pstcDmaNonSeqInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcDmaNonSeqInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcDmaNonSeqInit->u32Mode       = DMA_NON_SEQ_NONE;
        pstcDmaNonSeqInit->u32SrcCount   = 0x00UL;
        pstcDmaNonSeqInit->u32SrcOffset  = 0x00UL;
        pstcDmaNonSeqInit->u32DestCount  = 0x00UL;
        pstcDmaNonSeqInit->u32DestOffset = 0x00UL;
    }
    return i32Ret;
}

/**
 * @brief  DMA non-sequence mode initialize.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  CM_DMAx or CM_DMA
 * @param  [in] u8Ch DMA channel. @ref DMA_Channel_selection
 * @param  [in] pstcDmaNonSeqInit DMA non-sequence mode config structure.
  * @retval int32_t:
 *          - LL_OK: DMA non-sequence function initialize successful
 *          - LL_ERR_INVD_PARAM: NULL pointer
 * @note Call this function after DMA_Init();
 */
int32_t DMA_NonSeqInit(CM_DMA_TypeDef *DMAx, uint8_t u8Ch, const stc_dma_nonseq_init_t *pstcDmaNonSeqInit)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t *CHCTLx;

